
/*
  4. Заданы размеры А, В прямоугольного отверстия и размеры х, у, z кирпича.
     Определить, пройдет ли кирпич через отверстие.
*/

package Task_2_4;

import java.util.Scanner;

public class Task_2_4 {

	public static void main(String[] args) {
		
		  System.out.println("ПРОГРАММА: ПРОЙДЁТ ЛИ КИРПИЧ ЧЕРЕЗ ПРЯМОУГОЛЬНОЕ ОТВЕРСТИЕ ?");
		  System.out.println("------------------------------------------------------------");
		  System.out.println("------------------------------------------------------------");
		
		  Scanner scanner = new Scanner(System.in);
		
		// Размеры прямоугольного отверстия
		   double A; // Длина прямоугольного отверстия
		   double B; // Ширина прямоугольного отверстия
		
		// Размеры кирпича
		   double x; // Длина кирпича
		   double y; // Ширина кирпича
		   double z; // Высота кирпича
		   
		   
		   System.out.println("Введите размеры прямоугольного отверстия : Длина - A, Ширина - B ");
		   System.out.println("-----------------------------------------------------------------");
		   System.out.println("-----------------------------------------------------------------");
			
		   System.out.print("Введите значения : Длина прямоугольного отверстия - A............:");
		   A = scanner.nextDouble();
		   System.out.println("----------------------------------------------------------------");
			
		   System.out.print("Введите значения : Ширина прямоугольного отверстия - B...........:");
		   B = scanner.nextDouble();
		   System.out.println("----------------------------------------------------------------");
			
		   System.out.println("----------------------------------------------------------------");
		   System.out.println("Введите размеры кирпича : Длина - x, Ширина - y, Высота - z ");
		   System.out.println("----------------------------------");
				
		   System.out.print("Введите значения : Длина кирпича - x...........:");
		   x = scanner.nextDouble();
		   System.out.println("-----------------------------------------------------------------");
				
		   System.out.print("Введите значения : Ширина кирпича - y...........:");
		   y = scanner.nextDouble();
		   System.out.println("-----------------------------------------------------------------");
				
		   System.out.print("Введите значения : Высота кирпича - z...........:");
		   z = scanner.nextDouble();
		   System.out.println("-----------------------------------------------------------------");
			
		   if ( (( A >= z) & ( B >= y )) | ((A >= y ) & ( B >= z)) | (( A >= x ) & ( B >= z )) | ((A >= z) & ( B >= x )) | (( A >= x) & ( B >= y )) | ((A >= y ) & ( B >= x)) )
		         
		       {
			     System.out.println("--------------------------------------------");
			     System.out.println("Кирпич пройдёт через прямоугольное отверстие");
			     System.out.println("--------------------------------------------");
		       }
		   
		      else
		          {
		    	   System.out.println("-----------------------------------------------");
		    	   System.out.println("Кирпич не пройдёт через прямоугольное отверстие");
				   System.out.println("-----------------------------------------------");
		         }
		
		  scanner.close();
	}

}
